/* See comment at end for file info*/
#pragma once

#include "standard.h"

class CTgaHeader
{
public:

	BYTE m_idLength;        /* 00h  Size of Image ID field */
	BYTE m_colorMapType;    /* 01h  Color map type */
	BYTE m_imageType;       /* 02h  Image type code */
	WORD m_cMapStart;       /* 03h  Color map origin */
	WORD m_cMapLength;      /* 05h  Color map length */
	BYTE m_cMapDepth;       /* 07h  Depth of color map entries */
	WORD m_xOffset;         /* 08h  X origin of image */
	WORD m_yOffset;         /* 0Ah  Y origin of image */
	WORD m_width;           /* 0Ch  Width of image */
	WORD m_height;          /* 0Eh  Height of image */
	BYTE m_pixelDepth;      /* 10h  Image pixel size */

	// bit 0-3 contain the number of attribute bits per pixel; bits are found only for 16 and 32 bit
	// bit 4 left or right
	// bit 5 top or bottom
	// bit 6-7 are unused
	BYTE m_imageDescriptor;

	CTgaHeader()
	{
		memset(this, 0x00, sizeof(CTgaHeader));
	}
};

class CTgaFooter
{
public:

	enum
	{
		E_SIGNATURE_SIZE = 18
	};

	DWORD m_extensionOffset;	/* Extension Area Offset */
	DWORD m_developerOffset;	/* Developer Directory Offset */

	char m_signature[CTgaFooter::E_SIGNATURE_SIZE];		/* TGA Signature */

	CTgaFooter()
	{
		memset(this, 0x00, sizeof(CTgaFooter));
	}

	void ReadValues(FILE* file)
	{
		fread_s(&m_extensionOffset, sizeof(DWORD), sizeof(DWORD), 1, file);
		fread_s(&m_developerOffset, sizeof(DWORD), sizeof(DWORD), 1, file);

		fread_s(&m_signature, sizeof(char) * CTgaFooter::E_SIGNATURE_SIZE, sizeof(char), CTgaFooter::E_SIGNATURE_SIZE, file);
	}
};

class CTgaTag
{
public:

	WORD m_tagNumber; /* ID Number of the tag */
